AWS_RedisCluster/6_redis/4Stress_cpu8.txt
====== PING_INLINE ======
  100000 requests completed in 5.86 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
16.47% <= 2 milliseconds
57.95% <= 3 milliseconds
89.09% <= 4 milliseconds
98.07% <= 5 milliseconds
99.26% <= 6 milliseconds
99.53% <= 7 milliseconds
99.70% <= 8 milliseconds
99.82% <= 9 milliseconds
99.88% <= 10 milliseconds
99.90% <= 12 milliseconds
99.92% <= 13 milliseconds
99.94% <= 14 milliseconds
99.97% <= 15 milliseconds
99.99% <= 16 milliseconds
100.00% <= 16 milliseconds
17079.42 requests per second

====== PING_BULK ======
  100000 requests completed in 4.46 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
38.73% <= 2 milliseconds
93.65% <= 3 milliseconds
98.93% <= 4 milliseconds
99.63% <= 5 milliseconds
99.84% <= 6 milliseconds
99.85% <= 7 milliseconds
99.90% <= 8 milliseconds
99.94% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 204 milliseconds
22431.58 requests per second

====== SET ======
  100000 requests completed in 4.35 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
39.55% <= 2 milliseconds
96.34% <= 3 milliseconds
99.54% <= 4 milliseconds
99.89% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 6 milliseconds
22967.39 requests per second

====== GET ======
  100000 requests completed in 4.37 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
40.77% <= 2 milliseconds
95.77% <= 3 milliseconds
98.83% <= 4 milliseconds
99.59% <= 5 milliseconds
99.90% <= 6 milliseconds
99.93% <= 7 milliseconds
99.97% <= 8 milliseconds
99.98% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 10 milliseconds
22883.29 requests per second

====== INCR ======
  100000 requests completed in 4.37 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
40.35% <= 2 milliseconds
95.56% <= 3 milliseconds
99.08% <= 4 milliseconds
99.77% <= 5 milliseconds
99.95% <= 6 milliseconds
100.00% <= 7 milliseconds
22904.26 requests per second

====== LPUSH ======
  100000 requests completed in 4.43 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
39.23% <= 2 milliseconds
94.41% <= 3 milliseconds
98.75% <= 4 milliseconds
99.63% <= 5 milliseconds
99.89% <= 6 milliseconds
99.95% <= 18 milliseconds
99.96% <= 19 milliseconds
99.99% <= 20 milliseconds
100.00% <= 25 milliseconds
22563.18 requests per second

====== RPUSH ======
  100000 requests completed in 4.55 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
37.25% <= 2 milliseconds
91.75% <= 3 milliseconds
97.98% <= 4 milliseconds
99.25% <= 5 milliseconds
99.73% <= 6 milliseconds
99.82% <= 7 milliseconds
99.89% <= 8 milliseconds
99.93% <= 9 milliseconds
99.94% <= 10 milliseconds
99.95% <= 11 milliseconds
99.97% <= 12 milliseconds
99.99% <= 13 milliseconds
100.00% <= 13 milliseconds
21997.36 requests per second

====== LPOP ======
  100000 requests completed in 4.82 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
33.53% <= 2 milliseconds
87.59% <= 3 milliseconds
96.36% <= 4 milliseconds
98.35% <= 5 milliseconds
99.12% <= 6 milliseconds
99.35% <= 7 milliseconds
99.46% <= 8 milliseconds
99.56% <= 9 milliseconds
99.64% <= 10 milliseconds
99.73% <= 11 milliseconds
99.81% <= 12 milliseconds
99.88% <= 13 milliseconds
99.90% <= 14 milliseconds
99.90% <= 15 milliseconds
99.93% <= 16 milliseconds
99.95% <= 17 milliseconds
99.95% <= 18 milliseconds
99.96% <= 19 milliseconds
99.97% <= 20 milliseconds
99.98% <= 21 milliseconds
100.00% <= 36 milliseconds
100.00% <= 204 milliseconds
20755.50 requests per second

====== RPOP ======
  100000 requests completed in 5.39 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
24.22% <= 2 milliseconds
74.66% <= 3 milliseconds
91.54% <= 4 milliseconds
96.55% <= 5 milliseconds
98.53% <= 6 milliseconds
99.13% <= 7 milliseconds
99.33% <= 8 milliseconds
99.49% <= 9 milliseconds
99.60% <= 10 milliseconds
99.68% <= 11 milliseconds
99.79% <= 12 milliseconds
99.90% <= 13 milliseconds
99.95% <= 14 milliseconds
99.98% <= 15 milliseconds
100.00% <= 16 milliseconds
100.00% <= 16 milliseconds
18535.68 requests per second

====== SADD ======
  100000 requests completed in 4.76 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
33.86% <= 2 milliseconds
88.93% <= 3 milliseconds
96.97% <= 4 milliseconds
98.40% <= 5 milliseconds
98.98% <= 6 milliseconds
99.31% <= 7 milliseconds
99.46% <= 8 milliseconds
99.57% <= 9 milliseconds
99.71% <= 10 milliseconds
99.82% <= 11 milliseconds
99.86% <= 12 milliseconds
99.92% <= 13 milliseconds
99.96% <= 14 milliseconds
99.99% <= 15 milliseconds
100.00% <= 16 milliseconds
21026.07 requests per second

====== HSET ======
  100000 requests completed in 4.50 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
39.63% <= 2 milliseconds
94.04% <= 3 milliseconds
97.79% <= 4 milliseconds
98.66% <= 5 milliseconds
99.38% <= 6 milliseconds
99.58% <= 7 milliseconds
99.68% <= 8 milliseconds
99.74% <= 9 milliseconds
99.85% <= 10 milliseconds
99.92% <= 11 milliseconds
99.94% <= 12 milliseconds
99.97% <= 13 milliseconds
99.99% <= 14 milliseconds
100.00% <= 14 milliseconds
22207.42 requests per second

====== SPOP ======
  100000 requests completed in 4.65 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
35.01% <= 2 milliseconds
90.31% <= 3 milliseconds
97.55% <= 4 milliseconds
98.79% <= 5 milliseconds
99.40% <= 6 milliseconds
99.66% <= 7 milliseconds
99.75% <= 8 milliseconds
99.83% <= 9 milliseconds
99.91% <= 10 milliseconds
99.95% <= 11 milliseconds
99.95% <= 13 milliseconds
99.96% <= 14 milliseconds
100.00% <= 14 milliseconds
21496.13 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 4.41 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
39.16% <= 2 milliseconds
95.50% <= 3 milliseconds
99.19% <= 4 milliseconds
99.56% <= 5 milliseconds
99.74% <= 6 milliseconds
99.84% <= 7 milliseconds
99.88% <= 8 milliseconds
99.97% <= 9 milliseconds
100.00% <= 9 milliseconds
22655.19 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 4.65 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
34.43% <= 2 milliseconds
89.96% <= 3 milliseconds
97.78% <= 4 milliseconds
99.23% <= 5 milliseconds
99.61% <= 6 milliseconds
99.75% <= 7 milliseconds
99.89% <= 8 milliseconds
99.98% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 202 milliseconds
21523.89 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 4.59 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
36.60% <= 2 milliseconds
90.53% <= 3 milliseconds
97.72% <= 4 milliseconds
99.44% <= 5 milliseconds
99.81% <= 6 milliseconds
99.88% <= 7 milliseconds
99.90% <= 8 milliseconds
99.90% <= 10 milliseconds
99.92% <= 11 milliseconds
99.93% <= 12 milliseconds
99.95% <= 13 milliseconds
99.96% <= 14 milliseconds
99.98% <= 15 milliseconds
100.00% <= 16 milliseconds
100.00% <= 16 milliseconds
21781.75 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 4.55 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
36.18% <= 2 milliseconds
91.55% <= 3 milliseconds
98.48% <= 4 milliseconds
99.70% <= 5 milliseconds
99.92% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 8 milliseconds
100.00% <= 8 milliseconds
21982.85 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 5.05 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
29.02% <= 2 milliseconds
78.44% <= 3 milliseconds
94.24% <= 4 milliseconds
99.15% <= 5 milliseconds
99.81% <= 6 milliseconds
99.92% <= 7 milliseconds
99.93% <= 8 milliseconds
99.94% <= 9 milliseconds
99.94% <= 10 milliseconds
99.96% <= 11 milliseconds
99.97% <= 12 milliseconds
99.99% <= 13 milliseconds
100.00% <= 14 milliseconds
100.00% <= 203 milliseconds
19790.22 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 5.78 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
19.99% <= 2 milliseconds
62.93% <= 3 milliseconds
86.88% <= 4 milliseconds
96.75% <= 5 milliseconds
98.86% <= 6 milliseconds
99.41% <= 7 milliseconds
99.54% <= 8 milliseconds
99.63% <= 9 milliseconds
99.73% <= 10 milliseconds
99.80% <= 11 milliseconds
99.85% <= 12 milliseconds
99.93% <= 13 milliseconds
99.98% <= 14 milliseconds
100.00% <= 14 milliseconds
17298.04 requests per second